//import commonGainDTO from '@/数据/技能增益/common'
import { SkillBasicDTO } from "@/@types/skill";
// import { 增益计算类型枚举, 增益类型枚举 } from '@/@types/enum'
// import 贯穿GainDTO from './技能增益/贯穿'
// import 劲风簇GainDTO from './技能增益/劲风簇'
// import 饮羽簇GainDTO from './技能增益/饮羽簇'
// import 宠物GainDTO from './技能增益/宠物通用'
import 木落雁归GainDTO from "./技能增益/木落雁归";
import 振翅图南GainDTO from "./技能增益/振翅图南";
import commonGainDTO from "./技能增益/common";
import 翼绝云天GainDTO from "./技能增益/翼绝云天";
import 海运南冥GainDTO from "./技能增益/海运南冥";
import { 增益类型枚举, 增益计算类型枚举 } from "@/@types/enum";

const 外攻基础系数 = 16 * 10;

// 获取实际系数
const 获取实际系数 = (系数, dot跳数?, dot间隔?) => {
  if (dot跳数 && dot间隔) {
    return Math.max(
      (Math.floor(系数) * Math.max(Math.floor((dot跳数 * dot间隔) / 12), 16)) /
        dot跳数 /
        16 /
        外攻基础系数,
      0.0625
    );
  }

  return Math.floor(系数) / 外攻基础系数;
};

// const 贯穿伤害系数 = (215 * 0.7 * 1.15 * 0.9) / 160 / 4
// const 贯穿伤害系数 = 获取实际系数(215 * 0.7 * 1.15 * 0.9 * 0.9 * 0.9, 4, 8);

// const 贯穿基础伤害 = 0;
const 破招全局系数 = 13.1925;

const WanlingSkillDataDTO: SkillBasicDTO[] = [
  {
    技能名称: "击水三千·一",
    技能伤害系数: 0.98749,
    技能基础伤害_最小值: 500,
    技能基础伤害_最大值: 515,
    武器伤害系数: 1,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: "击水三千·二",
    技能伤害系数: 1.11249,
    技能基础伤害_最小值: 500,
    技能基础伤害_最大值: 515,
    武器伤害系数: 1,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: "击水三千·三",
    技能伤害系数: 1.23749,
    技能基础伤害_最小值: 500,
    技能基础伤害_最大值: 515,
    武器伤害系数: 1,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },

  {
    技能名称: "木落雁归",
    技能伤害系数: 2.04999,
    技能基础伤害_最小值: 1083,
    技能基础伤害_最大值: 1098,
    武器伤害系数: 2,
    伤害计算次数: 1,
    技能增益列表: 木落雁归GainDTO,
  },
  {
    技能名称: "定波砥澜",
    技能伤害系数: 2.0625,
    技能基础伤害_最小值: 130,
    技能基础伤害_最大值: 135,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: "翼绝云天",
    技能伤害系数: 0.95624,
    技能基础伤害_最小值: 417,
    技能基础伤害_最大值: 432,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: 翼绝云天GainDTO,
  },
  {
    技能名称: "振翅图南",
    技能伤害系数: 0.6,
    技能基础伤害_最小值: 458,
    技能基础伤害_最大值: 468,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: 振翅图南GainDTO,
  },

  {
    技能名称: "跃潮斩波",
    技能伤害系数: 2.11249,
    技能基础伤害_最小值: 1625,
    技能基础伤害_最大值: 1635,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: "浮游天地",
    技能伤害系数: 0.875,
    技能基础伤害_最小值: 833,
    技能基础伤害_最大值: 843,
    武器伤害系数: 2,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: "海运南冥",
    技能伤害系数: 1.325,
    技能基础伤害_最小值: 1043,
    技能基础伤害_最大值: 1058,
    武器伤害系数: 0,
    伤害计算次数: 2,
    技能增益列表: 海运南冥GainDTO,
  },
  {
    技能名称: "溟海御波",
    技能伤害系数: 2.125,
    技能基础伤害_最小值: 1625,
    技能基础伤害_最大值: 1640,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: "逐波灵游",
    技能伤害系数: 0.12297,
    技能基础伤害_最小值: 833,
    技能基础伤害_最大值: 848,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: "青冥",
    技能伤害系数: 0.73126,
    技能基础伤害_最小值: 133,
    技能基础伤害_最大值: 143,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: "青冥(DOT)",
    技能伤害系数: 3.43799,
    技能基础伤害_最小值: 50,
    技能基础伤害_最大值: 50,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },

  {
    技能名称: "破",
    // 技能伤害系数: 13.1925 * 0.48 * 1.05,
    技能伤害系数: 破招全局系数 * 0.3,
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: "逐云寒蕊",
    技能伤害系数: 1.274,
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: [
      ...commonGainDTO,
      {
        增益名称: "飘黄",
        增益所在位置: "套装",
        常驻增益: true,
        增益集合: [
          {
            增益类型: 增益类型枚举.郭氏无视防御,
            增益计算类型: 增益计算类型枚举.A,
            增益数值: 1024,
          },
        ],
      },
    ],
  },
  {
    // 伤腕
    技能名称: "昆吾·弦刃",
    技能伤害系数: 获取实际系数(75),
    技能基础伤害_最小值: 40,
    技能基础伤害_最大值: 57,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    // 伤鞋
    技能名称: "刃凌",
    技能伤害系数: 获取实际系数(60),
    技能基础伤害_最小值: 40,
    技能基础伤害_最大值: 57,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    // 龙门武器
    技能名称: "剑风",
    技能伤害系数: 0,
    技能基础伤害_最小值: 3950,
    技能基础伤害_最大值: 3950,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: "劲风簇·神兵",
    技能伤害系数: 获取实际系数(60),
    技能基础伤害_最小值: 20,
    技能基础伤害_最大值: 22,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  // CW期间饮羽命中后施加的额外伤害
  {
    技能名称: "月弦激星",
    技能伤害系数: 获取实际系数(390),
    技能基础伤害_最小值: 20,
    技能基础伤害_最大值: 22,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
];

export default WanlingSkillDataDTO;
